/**
 *****************************************
 * Created by lifx
 * Created on 2017-12-26 11:34:44
 *****************************************
 */
'use strict';


/**
 *****************************************
 * 加载依赖
 *****************************************
 */
import React, { Component } from 'react';


/**
 *****************************************
 * 视图组件
 *****************************************
 */
export default class AppLink extends Component {
    render() {
        return this.props.children;
    }
}
