/**
 *****************************************
 * Created by lifx
 * Created on 2017-12-27 14:33:14
 *****************************************
 */
'use strict';


/**
 *****************************************
 * 加载依赖
 *****************************************
 */
import { appendToTarget } from '../app-provider';


/**
 *****************************************
 * 定义元素
 *****************************************
 */
const model = {
    target: document.createElement('article')
};


/**
 *****************************************
 * 设置样式
 *****************************************
 */
model.target.className = 'app-content abs box';


/**
 *****************************************
 * 挂载节点
 *****************************************
 */
appendToTarget(model.target);


/**
 *****************************************
 * 添加内容
 *****************************************
 */
export function appendChild(el) {
    return model.target.appendChild(el);
}


/**
 *****************************************
 * 移除内容
 *****************************************
 */
export function removeChild(el) {
    return model.target.removeChild(el);
}

