/**
 *****************************************
 * Created by lifx
 * Created on 2017-12-29 21:40:21
 *****************************************
 */
'use strict';


/**
 *****************************************
 * 定义数据模型
 *****************************************
 */
const model = { target: null };


/**
 *****************************************
 * 更新对象
 *****************************************
 */
export function updateTarget(target) {
    model.target = target;
}


/**
 *****************************************
 * 挂载内容
 *****************************************
 */
export function mount(el) {
    model.target && model.target.appendChild(el);
}


/**
 *****************************************
 * 卸载内容
 *****************************************
 */
export function unmount(el) {
    model.target && model.target.removeChild(el);
}
