/**
 *****************************************
 * Created by lifx
 * Created on 2018-02-11 10:11:59
 *****************************************
 */
'use strict';


/**
 *****************************************
 * 加载依赖
 *****************************************
 */
import { dispatch } from '../selector';


/**
 *****************************************
 * 定义行为类型
 *****************************************
 */
export const UPDATE_APP_ROUTER = 'app/update_router';


/**
 *****************************************
 * 更新路由信息
 *****************************************
 */
export function updateAppRouter(data) {
    return dispatch({ type: UPDATE_APP_ROUTER, data });
}
