/**
 *****************************************
 * Created by lifx
 * Created on 2017-12-26 15:58:54
 *****************************************
 */
'use strict';


/**
 *****************************************
 * 加载依赖
 *****************************************
 */
import { UPDATE_APP_ROUTER } from './actionTypes';


/**
 *****************************************
 * 更新路由信息
 *****************************************
 */
export function updateAppRouter(data = {}) {
    return { type: UPDATE_APP_ROUTER, data };
}
