/**
 *****************************************
 * Created by lifx
 * Created on 2017-12-26 17:21:59
 *****************************************
 */
'use strict';


/**
 *****************************************
 * 加载依赖
 *****************************************
 */
import { Component } from 'react';
import createHistory from './history';


/**
 *****************************************
 * 路由组件
 *****************************************
 */
class AppRoute extends Component {

    // 渲染组件
    render() {
        return this.props.render();
    }
}


/**
 *****************************************
 * 抛出组件
 *****************************************
 */
export default AppRoute;
