/**
 *****************************************
 * Created by lifx
 * Created on 2018-02-02 17:41:26
 *****************************************
 */
'use strict';


/**
 *****************************************
 * 加载模块
 *****************************************
 */
import assign from './assign';


/**
 *****************************************
 * 测试模块
 *****************************************
 */
describe('测试【assign】', () => {

    /* 测试合并对象 */
    test('测试合并对象', () => {
        let a = { a: 1 },
            b = { b: 2 },
            c = [1, 2, 3],
            d = { c: 3, b: 'b' },
            r = assign( a, b, null, undefined, 1, '1', c, 0, d );

        // 校验结果
        expect(r).toEqual({ a: 1, b: 'b', c: 3, 0: 1, 1: 2, 2: 3 });
        expect(r).not.toBe(a);
        expect(r).not.toBe(b);
    });
});
