/**
 *****************************************
 * Created by lifx
 * Created on 2017-11-27 15:21:01
 *****************************************
 */
'use strict';


/**
 *****************************************
 * 加载依赖
 *****************************************
 */
const path = require('path');


/**
 *****************************************
 * 自定义文件转换器
 *****************************************
 */
module.exports = {
    process(src, filename) {
        return `module.exports = ${JSON.stringify(path.basename(filename))};`;
    }
};
