/**
 *****************************************
 * Created by lifx
 * Created on 2018-03-05 19:49:57
 *****************************************
 */
'use strict';


/**
 *****************************************
 * 加载依赖
 *****************************************
 */
import createEvent from './SyntheticEvent';


/**
 *****************************************
 * 创建事件插件
 *****************************************
 */
export default function create() {
    let event = createEvent();

    console.log(event);
}

