/**
 *****************************************
 * Created by lifx
 * Created on 2017-12-26 11:44:20
 *****************************************
 */
'use strict';


/**
 *****************************************
 * 加载依赖
 *****************************************
 */
import { UPDATE_APP_DEVICE } from './actionTypes';


/**
 *****************************************
 * 更新设置信息
 *****************************************
 */
export function updateAppDevice(data = {}) {
    return { type: UPDATE_APP_DEVICE, data };
}
