/**
 *****************************************
 * Created by lifx
 * Created on 2017-12-29 23:07:11
 *****************************************
 */
'use strict';


/**
 *****************************************
 * 定义行为类型
 *****************************************
 */
export const UPDATE_APP_DEVICE = 'app/update_device';


/**
 *****************************************
 * 更新设备信息
 *****************************************
 */
export function updateAppDevice(data) {
    return { type: UPDATE_APP_DEVICE, data };
}
