/**
 *****************************************
 * Created by lifx
 * Created on 2017-11-13 16:46:46
 *****************************************
 */
'use strict';


/**
 *****************************************
 * 加载依赖
 *****************************************
 */
import './index.scss?global';
import * as style from '$$style';
import * as settings from './settings';


/**
 *****************************************
 * 抛出风格设置
 *****************************************
 */
export default { ...settings, ...style };
