/**
 *****************************************
 * Created by lifx
 * Created on 2017-11-20 11:09:42
 *****************************************
 */
'use strict';


/**
 *****************************************
 * 加载依赖
 *****************************************
 */
import { UPDATE_APP_HISTORY } from './types';


/**
 *****************************************
 * 更新历史记录
 *****************************************
 */
export function updateAppHistory(data) {
    return data && { type: UPDATE_APP_HISTORY, data };
}
